{"name":"Understand Financial Statements","purpose":"This book is about financial intelligence—about knowing what the numbers really mean. It provides the financial knowledge entrepreneurs and company owners need to run their business more effectively. It teaches how to read the three major financial statements and interpret the information they contain.","inputs":[{"name":"Financial Statements","type":"financial reports","required":true,"description":"The three major financial statements: income statement, balance sheet, and cash flow statement."}],"preconditions":["Entrepreneur or company owner needs to understand their company's finances","Some basic familiarity with financial concepts"],"steps":[{"n":1,"text":"Learn how to read and interpret the income statement, balance sheet, and cash flow statement."},{"n":2,"text":"Understand the key information contained in each financial statement and what it means for the business."},{"n":3,"text":"Develop the ability to talk numbers with bankers, investors, and partners."},{"n":4,"text":"Use financial intelligence to manage the business as it grows."}],"outputs":[{"name":"Financial Intelligence","type":"knowledge","description":"Understanding of financial statements and how to use them to run the business more effectively."}],"failure_modes":["Inability to understand financial statements and their implications","Continuing to operate the business based on intuition and gut feel rather than financial data"],"examples":[{"input":"Financial statements for Zingerman's Deli","output":"Improved ability to manage cash flow and profitability","notes":"The founders initially struggled to hold onto the money coming in, despite high sales."},{"input":"Financial statements for Joie de Vivre hotel chain","output":"Ability to communicate with bankers, investors, and partners","notes":"The founder had a finance background, but most entrepreneurs do not and need to build this skill."}],"tags":["financial statements","financial intelligence","entrepreneurship","business management"],"span_ids":["557f9f13-bc40-467e-bc18-a30a4f3d36cb","0c734a39-f65f-404d-8bd7-5301b637e9e9"],"confidence":0.9,"id":"AZIWDEQ8XI58ODR0NDSTUA","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Understanding the Foundation","purpose":"Explain the importance of understanding financial reports, such as the income statement, balance sheet, and cash flow statement, in order to effectively manage a business. Emphasize that this foundational financial intelligence is critical for entrepreneurs, even if they do not have a finance background.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Describe a cautionary tale of two entrepreneurs whose business was growing rapidly, but they did not understand their financial reports and ran out of cash in about 18 months."},{"n":2,"text":"Explain that entrepreneurs who are financially intelligent can read and understand the income statement, balance sheet, and cash flow statement, and know the difference between profitability and healthy cash flow."},{"n":3,"text":"Introduce the income statement and explain that it shows revenues, expenses, and profit for a period of time."}],"outputs":[{"name":"Understanding of the importance of financial intelligence for entrepreneurs","type":"concept","description":"Entrepreneurs who understand financial reports like the income statement, balance sheet, and cash flow statement are better equipped to manage their business effectively, even if they do not have a finance background."}],"failure_modes":["Entrepreneurs may not believe the importance of understanding financial reports and continue to manage the business based only on their checkbook."],"examples":[{"input":"Two entrepreneurs whose business was doubling sales each year, but they did not understand their financial reports.","output":"The entrepreneurs ran out of cash in about 18 months and had to sell part of their business to outside investors."}],"tags":["financial intelligence","financial reports","income statement","cash flow","entrepreneurship"],"span_ids":["6b641b6a-d351-4220-a4cb-867e6a9e3e62","d9e04ca8-f740-4e1d-a240-9f75eebceca2","448f913d-2af9-4778-94bc-66b759038c58"],"confidence":0.8,"id":"AZIWDGEDMFTCQKRAKHEJBQ","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Understand when revenue should be recognized","purpose":"Explain the concept of revenue recognition and the different options for when revenue can be recorded, highlighting the judgment calls and assumptions involved.","inputs":[{"name":"Revenue or sales","type":"financial metric","required":true,"description":"The value of what a company sold to its customers during a given period"}],"preconditions":["Use accrual accounting"],"steps":[{"n":1,"text":"Determine when revenue should be recorded or 'recognized', considering options such as when a contract is signed, when the product or service is delivered, when the invoice is sent out, or when the bill is paid."},{"n":2,"text":"Recognize that implementing the fundamental rule of recording revenue when the product or service is delivered requires making a number of assumptions."},{"n":3,"text":"Understand that the question of 'when is a sale a sale?' was a hot topic in many fraud cases, as companies could use judgment calls to improperly recognize revenue."},{"n":4,"text":"Illustrate the issue with an example of a business reselling specialized telephone equipment with a maintenance contract, where the accountant must estimate the value of the services to be provided over the year."}],"outputs":[{"name":"Properly recognized revenue","type":"financial metric","description":"The amount of revenue that should be recorded on the books based on the delivery of products or services"}],"failure_modes":["Improperly recognizing revenue to inflate profits, as seen in the Xerox case"],"examples":[{"input":{"company":"Xerox","contract_details":"Selling equipment on four-year contracts, including service and maintenance"},"output":{"improperly_recognized_revenue":"$6 billion"},"notes":"Xerox executives decided to book ever-increasing percentages of the anticipated revenues and associated profits upfront, rather than properly allocating them over the contract period."}],"tags":["revenue recognition","accounting judgments","financial reporting","fraud prevention"],"span_ids":["d19e2ada-08cb-4748-88d2-6fa45d220b4b","f08b8399-7eae-4195-affc-d7cd953e1cb7"],"confidence":0.9,"id":"AZIWDLYSRJJ6NWV9GPMS4Q","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Distinguish between capital expenditures and operating expenses","purpose":"Explain the difference between capital expenditures and operating expenses, and how the classification can be subject to judgment and affect a company's profitability.","inputs":[{"name":"Expense","type":"financial metric","required":true,"description":"A cost required to keep the business running day-to-day"}],"preconditions":["Company has rules about expense classification","Company is subject to accounting standards and regulations"],"steps":[{"n":1,"text":"Understand that operating expenses are costs required to keep the business going day-to-day, such as salaries, benefits, and insurance."},{"n":2,"text":"Recognize that capital expenditures are purchases of long-term investments, such as computer systems and equipment."},{"n":3,"text":"Note that operating expenses reduce profit immediately, while capital expenditures spread the impact over multiple accounting periods through depreciation."},{"n":4,"text":"Explain how the classification of an expense as either operating or capital can be subject to judgment and discretion, which can dramatically affect a company's reported profits."},{"n":5,"text":"Caution that improper classification, such as classifying operating expenses as capital expenditures, was a tactic used in financial scandals like the WorldCom case."}],"outputs":[{"name":"Properly classified expenses","type":"financial metric","description":"Expenses recorded as either operating expenses or capital expenditures based on the company's accounting policies and standards"}],"failure_modes":["Misclassifying operating expenses as capital expenditures to inflate profits"],"examples":[{"input":{"company":"WorldCom","expense_type":"office supplies"},"output":{"improper_classification":"Classified as capital expenditures instead of operating expenses"},"notes":"WorldCom's management misclassified operating expenses as capital expenditures to make the company appear more profitable."}],"tags":["capital expenditures","operating expenses","expense classification","financial reporting","fraud prevention"],"span_ids":["f08b8399-7eae-4195-affc-d7cd953e1cb7","40d183d1-3651-4b18-997a-40c87f5e4d4a"],"confidence":0.9,"id":"AZIWDLYSAFOWICTPITE8XG","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Financing Your Business","purpose":"Describes the common sources of financing for entrepreneurial companies, including owner financing, equity investment, and debt financing. It explains the pros and cons of each financing option and the role of financial staff in managing the company's finances.","inputs":[{"name":"Company financial health","type":"Financial information","required":true,"description":"Details about the company's current financial situation, including revenue, expenses, assets, and liabilities."}],"preconditions":["The company is an entrepreneurial or start-up business"],"steps":[{"n":1,"text":"Determine the company's initial financing sources, which often start with the owner's personal funds and credit cards."},{"n":2,"text":"Establish a business checking account and keep regular financial records using accounting software."},{"n":3,"text":"Consider seeking additional financing from external sources, such as equity investments or loans, to fund operations and growth."},{"n":4,"text":"Understand the pros and cons of different financing options, including owner financing, equity investment, and debt financing."},{"n":5,"text":"Consult an accountant or financial advisor to help structure the financing in a way that considers taxes, future banking and financing requirements, and other factors."}],"outputs":[{"name":"Financing plan","type":"Document","description":"A detailed plan outlining the company's financing strategy, including the sources and structure of funding."}],"failure_modes":["Inadequate personal financial resources to self-finance the business","Inability to secure external financing from investors or lenders","Poorly structured financing that leads to unfavorable tax implications or future financing challenges"],"examples":[{"input":{"company_revenue":500000,"company_expenses":450000,"owner_personal_savings":100000,"owner_credit_card_limit":50000},"output":{"financing_plan":{"owner_financing":100000,"equity_investment":150000,"debt_financing":200000}},"notes":"The company is a start-up with moderate revenue and expenses. The owner has $100,000 in personal savings and a $50,000 credit card limit to contribute. Additional financing will be needed from equity investors and lenders."}],"tags":["financing","entrepreneurship","start-up","small business"],"span_ids":["f75fd255-4cfc-4589-99c7-1237854f626a"],"confidence":0.9,"id":"AZIWDSHAGINRURWZUDNKFQ","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Building a Financial Staff","purpose":"Describes the typical financial roles and responsibilities in a growing entrepreneurial company, including the bookkeeper, accountant, chief financial officer (CFO), treasurer, and controller.","inputs":[{"name":"Company size and growth stage","type":"Company information","required":true,"description":"Details about the company's current size, revenue, and growth trajectory to determine the appropriate financial staffing needs."}],"preconditions":["The company is an entrepreneurial or growing business"],"steps":[{"n":1,"text":"Start with a part-time bookkeeper, who may be the entrepreneur or a spouse, to handle basic financial record-keeping."},{"n":2,"text":"As the company grows, transition to a full-time bookkeeper or bookkeeping firm to manage the increasing volume of financial transactions."},{"n":3,"text":"Hire an accountant to review financial statements, prepare tax returns, and potentially serve as a financial advisor."},{"n":4,"text":"For larger companies, add a chief financial officer (CFO) to oversee financial management, strategy, and reporting."},{"n":5,"text":"In large companies, also consider hiring a treasurer to handle external financial communications and a controller to ensure accurate internal financial reporting."}],"outputs":[{"name":"Financial staffing plan","type":"Document","description":"A plan outlining the financial roles, responsibilities, and hiring timeline as the company grows."}],"failure_modes":["Insufficient financial staffing to support the company's growth and financial management needs","Poorly defined roles and responsibilities among the financial team","Inability to attract and retain qualified financial professionals"],"examples":[{"input":{"company_revenue":5000000,"company_employees":50},"output":{"financial_staff":[{"role":"bookkeeper","status":"full-time"},{"role":"accountant","status":"part-time"},{"role":"CFO","status":"full-time"}]},"notes":"The company has $5 million in revenue and 50 employees, indicating the need for a full-time bookkeeper, a part-time accountant, and a full-time CFO to manage the growing financial complexity."}],"tags":["financial management","entrepreneurship","small business","staffing"],"span_ids":["3c493dd4-afd7-48ff-8952-c73dc5b2c9b0"],"confidence":0.9,"id":"AZIWDSHAFSTFFH1-68UTSG","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Reading an Income Statement","purpose":"To provide steps and guidance for understanding and interpreting an income statement, which can often seem like a code that needs to be deciphered due to the complex and detailed nature of real-world income statements.","inputs":[{"name":"Income statement","type":"financial document","required":true,"description":"The income statement to be read and interpreted."}],"preconditions":["The income statement is available and accessible."],"steps":[{"n":1,"text":"Check the label at the top of the document to ensure it is an income statement, profit and loss statement, or similar financial report."},{"n":2,"text":"Determine the scope of the income statement, whether it is for the entire business, a division, business unit, or region."},{"n":3,"text":"Identify the time period covered by the income statement, such as a month, quarter, year, or year-to-date."},{"n":4,"text":"Note any formatting details, such as whether the numbers are presented in thousands or millions, and adjust accordingly."}],"outputs":[{"name":"Understanding of the income statement","type":"knowledge","description":"A better understanding of the context and format of the income statement, which is necessary for interpreting the financial data."}],"failure_modes":["Failing to properly identify the scope and time period of the income statement","Overlooking important formatting details that affect the interpretation of the numbers"],"examples":[{"input":"An income statement for a midsize or large company","output":"A better understanding of the complex and detailed nature of real-world income statements, and the steps necessary to properly read and interpret them.","notes":"The example highlights the challenge of deciphering income statements with dozens of lines and arcane labels, and the importance of gaining the proper context before attempting to interpret the financial data."}],"tags":["income statement","financial reporting","financial analysis"],"span_ids":["2ad14edf-ec04-459b-ac6d-540daaec07f1","7b2641af-abc6-40b5-b0dd-81719d84cd7e","57ff6a3e-a34a-4f6e-acf9-b9ee3735b529"],"confidence":0.9,"id":"AZIWDXVT1R2CHXEIQCKXYA","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Interpreting an Income Statement","purpose":"This procedure provides guidance on how to interpret and understand the key components and details of an income statement, including what it measures, the distinction between actual and pro forma statements, the main categories of numbers, and the importance of comparative data and footnotes.","inputs":[{"name":"Income statement","type":"financial report","required":true,"description":"The income statement being analyzed, either for the whole company or a specific division or business unit."}],"preconditions":["The income statement is available for review."],"steps":[{"n":1,"text":"Determine what the income statement is measuring, such as the entire business or a specific division or business unit."},{"n":2,"text":"Check the time period covered by the income statement, such as a month, quarter, year, or year-to-date."},{"n":3,"text":"Identify how the numbers are presented, such as in thousands or millions, and adjust accordingly."},{"n":4,"text":"Distinguish between actual income statements that show what happened and pro forma statements that exclude unusual or one-time charges."},{"n":5,"text":"Locate the three main categories of the income statement: sales/revenue, costs and expenses, and profit."},{"n":6,"text":"Analyze the relative size of the largest line items, such as cost of goods sold, to understand what is most important to the company."},{"n":7,"text":"Review any comparative data, such as previous periods or budgets, to identify significant variances and changes."},{"n":8,"text":"Carefully read any footnotes, which can provide important details about the company's accounting policies and assumptions used in the income statement."}],"outputs":[{"name":"Understanding of the income statement","type":"improved financial intelligence","description":"A better understanding of how to interpret the key components and details of an income statement, including what it measures, the distinction between actual and pro forma statements, the main categories of numbers, and the importance of comparative data and footnotes."}],"failure_modes":["Overlooking important details in the income statement, such as the time period or presentation of the numbers.","Failing to distinguish between actual and pro forma income statements.","Not analyzing the relative size of the largest line items to understand what is most important to the company.","Ignoring comparative data and variances that could indicate significant changes or issues.","Neglecting to carefully review the footnotes, which can provide important context and details."],"examples":[{"input":{"company":"Nathan's Famous, Inc.","fiscal_year":"2007","form":"10-K"},"output":{"key_footnotes":["Fiscal Year—The Company's fiscal year ends on the last Sunday in March, which results in a 52- or 53-week reporting period.","Interest Income—Interest income is recorded when it is earned and deemed realizable by the Company."],"notes":"The footnotes provide important details about the company's fiscal year and interest income accounting policy."}},{"input":{"company":"Build-A-Bear Workshop, Inc.","fiscal_year":"2006","form":"10-K"},"output":{"key_footnotes":["Retail Revenue Recognition—Net retail sales are net of discounts, exclude sales tax, and are recognized at the time of sale. Shipping and handling costs billed to customers are included in net retail sales. Revenues from the sale of gift cards are recognized at the time of redemption. Unredeemed gift cards are included in gift cards and customer deposits on the consolidated balance sheets. The company escheats a portion of unredeemed gift cards according to Delaware escheatment regulations that require remittance of the cost of merchandise portion of unredeemed gift cards over five years old. The difference between the value of gift cards and the amount escheated is recorded as a reduction in selling, general, and administrative expenses in the consolidated statement of operations."],"notes":"The footnote provides detailed information about the company's revenue recognition policies, particularly related to gift cards."}}],"tags":["income statement","financial reporting","financial analysis","accounting"],"span_ids":["57ff6a3e-a34a-4f6e-acf9-b9ee3735b529","13e5dd32-234e-496e-8f52-e8de5b138fcd","85b65083-aba1-48d1-934e-cefbdf02a765","2bf7aaa1-4992-4bfc-939d-e311c4f3a082","93b49773-df89-4a3d-9e24-ca049e900635"],"confidence":0.9,"id":"AZIWDATWFGWTSVTUPLZHXW","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Calculating Percent of","purpose":"Determine what percentage one number is of another number. This can be useful for analyzing a company's income statement to understand how much a specific expense or line item is as a percentage of the total.","inputs":[{"name":"Numerator","type":"number","required":true,"description":"The number you want to calculate the percentage of."},{"name":"Denominator","type":"number","required":true,"description":"The total or whole that the numerator is a part of."}],"preconditions":["The numerator and denominator are both known."],"steps":[{"n":1,"text":"Divide the numerator by the denominator."},{"n":2,"text":"Multiply the result by 100 to convert the decimal to a percentage."}],"outputs":[{"name":"Percent","type":"number","description":"The percentage the numerator is of the denominator."}],"failure_modes":["The denominator is zero, in which case the calculation is undefined.","The numerator and denominator are not compatible types (e.g. trying to calculate the percentage of a string)."],"examples":[{"input":{"numerator":6000,"denominator":50000},"output":12,"notes":"If a company spent $6,000 on supplies and had a total office budget of $50,000, the supplies expense is 12% of the total budget."}],"tags":["finance","accounting","income statement","percentage"],"span_ids":["04d09cf6-b384-49e7-b7b0-e945d608b57e"],"confidence":0.9,"id":"AZIWDETFGQUNUK26CG0YIQ","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Calculating Percent Change","purpose":"Determine the percentage change between two numbers, such as revenue from one year to the next or actual results versus budget. This can provide insight into how a company's financial performance is trending.","inputs":[{"name":"Old Value","type":"number","required":true,"description":"The previous or baseline value to compare against."},{"name":"New Value","type":"number","required":true,"description":"The current or new value to calculate the percent change against."}],"preconditions":["The old and new values are both known numeric amounts."],"steps":[{"n":1,"text":"Subtract the old value from the new value to get the absolute change."},{"n":2,"text":"Divide the absolute change by the old value."},{"n":3,"text":"Multiply the result by 100 to convert the decimal to a percentage."}],"outputs":[{"name":"Percent Change","type":"number","description":"The percentage the new value has changed compared to the old value."}],"failure_modes":["The old value is zero, in which case the percent change calculation is undefined.","The old and new values are not compatible types (e.g. trying to calculate percent change between a string and a number)."],"examples":[{"input":{"oldValue":3000,"newValue":3750},"output":25,"notes":"If prior year revenue was $3,000 and current year revenue was $3,750, the percent change in revenue is 25%."}],"tags":["finance","accounting","income statement","percentage","variance"],"span_ids":["04d09cf6-b384-49e7-b7b0-e945d608b57e"],"confidence":0.9,"id":"AZIWDETGLSJIUZTGWZYDQA","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Understanding Variance","purpose":"Variance refers to the difference between two numbers, such as budget versus actual or current period versus prior period. Understanding whether a variance is favorable or unfavorable is important for financial analysis and decision-making.","inputs":[{"name":"Actual Value","type":"number","required":true,"description":"The actual or current value."},{"name":"Expected Value","type":"number","required":true,"description":"The expected, budgeted, or prior period value to compare against."},{"name":"Line Item Type","type":"string","required":true,"description":"Indicates whether the line item is a revenue or expense account."}],"preconditions":["The actual and expected values, as well as the line item type, are known."],"steps":[{"n":1,"text":"Calculate the absolute difference between the actual and expected values."},{"n":2,"text":"Determine whether the variance is favorable or unfavorable based on the line item type:"},{"n":3,"text":"For revenue line items, a positive variance (actual > expected) is favorable, and a negative variance (actual < expected) is unfavorable."},{"n":4,"text":"For expense line items, a positive variance (actual < expected) is favorable, and a negative variance (actual > expected) is unfavorable."},{"n":5,"text":"Accounting conventions often use parentheses or negative signs to indicate unfavorable variances, so be sure to check how the variance is presented."}],"outputs":[{"name":"Variance Amount","type":"number","description":"The absolute difference between the actual and expected values."},{"name":"Variance Type","type":"string","description":"Whether the variance is favorable or unfavorable."}],"failure_modes":["The actual and expected values are not compatible types (e.g. trying to compare a string and a number).","The line item type is not clearly specified or does not match a recognized revenue or expense account."],"examples":[{"input":{"actualValue":6,"expectedValue":8,"lineItemType":"expense"},"output":{"varianceAmount":2,"varianceType":"favorable"},"notes":"If the actual expense was $6 and the expected expense was $8, the $2 positive variance is considered favorable."},{"input":{"actualValue":3750,"expectedValue":3000,"lineItemType":"revenue"},"output":{"varianceAmount":750,"varianceType":"favorable"},"notes":"If the actual revenue was $3,750 and the expected revenue was $3,000, the $750 positive variance is considered favorable."}],"tags":["finance","accounting","income statement","variance","budget"],"span_ids":["3e0574b6-84e6-4ef7-a145-c27eea1a84d1"],"confidence":0.8,"id":"AZIWDETGDXB8LV_TZUX-GW","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}
{"name":"Analyzing Net Profit","purpose":"Net profit is the bottom line of the income statement, representing what's left after all costs and expenses are subtracted from revenue. It's a key measure of a company's profitability and financial performance.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Net profit is calculated by taking a company's total revenue and subtracting all of its costs and expenses, including operating expenses, interest, taxes, and any other one-time charges."},{"n":2,"text":"Net profit is the final, 'bottom line' figure on the income statement, representing the company's overall profitability after all expenses have been accounted for."},{"n":3,"text":"For most companies, the goal should be to manage for the long-term by focusing on increasing profitable sales and reducing costs, rather than just cutting expenses in the short-term."}],"outputs":[{"name":"Net Profit","type":"number","description":"The final 'bottom line' profit figure after subtracting all expenses from revenue."}],"failure_modes":[],"examples":[],"tags":["finance","accounting","income statement","net profit","profitability"],"span_ids":["e0258f5c-49f7-4fc6-a8db-6bb97ce47e86"],"confidence":0.9,"id":"AZIWDETG6YDO6C7EJW4EFG","documentId":"d001f70b-7350-4dad-b963-4432ad247bab"}