{"name":"Understanding the Accounting Equation","purpose":"The accounting equation states that at all times, and without exceptions, the following will be true: Assets = Liabilities + Owners' Equity. This fundamental concept needs to be understood before creating financial statements.","inputs":[{"name":"None","type":"N/A","required":false,"description":"No explicit inputs required."}],"preconditions":[],"steps":[{"n":1,"text":"Understand that assets are all the property owned by the company."},{"n":2,"text":"Understand that liabilities are all the debts the company currently has outstanding to lenders."},{"n":3,"text":"Understand that owners' equity is the company's ownership interest in its assets, after all debts have been repaid."},{"n":4,"text":"Recognize that the accounting equation can be written as: Assets = Liabilities + Owners' Equity."},{"n":5,"text":"Alternatively, think of the accounting equation as: Assets - Liabilities = Owners' Equity."}],"outputs":[{"name":"Understanding of the accounting equation","type":"Conceptual knowledge","description":"The user understands the fundamental accounting equation and its meaning."}],"failure_modes":["Failing to grasp the meaning of assets, liabilities, and owners' equity","Inability to understand the equivalence of the two forms of the accounting equation"],"examples":[{"input":{"asset_value":300000,"liability_value":230000},"output":{"owners_equity":70000},"notes":"The example of a home ownership situation demonstrates the accounting equation in practice."}],"tags":["accounting equation","assets","liabilities","owners' equity"],"span_ids":["c155afe0-bce7-4f0c-a643-668b4a272940"],"confidence":0.9,"id":"AZIWDT-JZSBCTVQACTP4KG","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Understanding the Balance Sheet","purpose":"The balance sheet shows a company's financial situation at a given point in time, presenting the three main components of the accounting equation: assets, liabilities, and owners' equity.","inputs":[{"name":"None","type":"N/A","required":false,"description":"No explicit inputs required."}],"preconditions":["Understanding of the accounting equation"],"steps":[{"n":1,"text":"Recognize that the three main sections of a balance sheet are assets, liabilities, and owners' equity."},{"n":2,"text":"Understand the different types of assets, such as cash and cash equivalents, inventory, accounts receivable, and property, plant, and equipment."},{"n":3,"text":"Understand the different types of liabilities, such as accounts payable and notes payable."},{"n":4,"text":"Understand the components of owners' equity, such as common stock and retained earnings."},{"n":5,"text":"Recognize the distinction between current and long-term assets and liabilities."},{"n":6,"text":"Understand how a multi-period balance sheet can be used to analyze a company's financial position over time."}],"outputs":[{"name":"Understanding of the balance sheet","type":"Conceptual knowledge","description":"The user understands the purpose and structure of a balance sheet, as well as the different types of assets, liabilities, and owners' equity."}],"failure_modes":["Inability to distinguish between different types of assets and liabilities","Lack of understanding of the distinction between current and long-term items","Difficulty interpreting a multi-period balance sheet"],"examples":[{"input":{"assets":{"cash_and_cash_equivalents":50000,"inventory":110000,"accounts_receivable":20000,"property_plant_equipment":300000},"liabilities":{"accounts_payable":20000,"notes_payable":270000},"equity":{"common_stock":50000,"retained_earnings":140000}},"output":{"total_assets":480000,"total_liabilities":290000,"total_equity":190000},"notes":"The example balance sheet demonstrates the structure and components of a balance sheet."}],"tags":["balance sheet","assets","liabilities","owners' equity","current assets","long-term assets","current liabilities","long-term liabilities"],"span_ids":["b153c8b3-24af-4ee6-9e19-2e6d5ed55305"],"confidence":0.9,"id":"AZIWDT-JVWV1LLX9RLNRCG","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Understanding the Income Statement","purpose":"The income statement shows a company's financial performance over a period of time, typically one year. It details the company's revenues and expenses, and calculates the net income.","inputs":[{"name":"None","type":"N/A","required":false,"description":"No explicit inputs required."}],"preconditions":[],"steps":[{"n":1,"text":"Recognize that the income statement is organized into two main sections: revenues and expenses."},{"n":2,"text":"Understand the concept of gross profit, which is calculated as revenues minus cost of goods sold."},{"n":3,"text":"Distinguish between operating income, which includes only operating revenues and expenses, and net income, which includes all revenues and expenses."},{"n":4,"text":"Understand that the income statement provides a measure of a company's financial performance over a period of time, in contrast to the balance sheet's snapshot of financial position."}],"outputs":[{"name":"Understanding of the income statement","type":"Conceptual knowledge","description":"The user understands the purpose and structure of an income statement, including the distinction between gross profit, operating income, and net income."}],"failure_modes":["Inability to distinguish between operating and non-operating revenues and expenses","Difficulty interpreting the relationship between the income statement and the accounting equation"],"examples":[{"input":{"revenue":450000,"cost_of_goods_sold":75000,"operating_expenses":{"rent":45000,"salaries_and_wages":120000,"advertising":25000,"insurance":10000},"non_operating_income_and_expenses":{"gain_on_sale_of_investments":25000,"interest_expense":-13000}},"output":{"gross_profit":375000,"operating_income":175000,"net_income":187000},"notes":"The example income statement demonstrates the calculation of gross profit, operating income, and net income."}],"tags":["income statement","revenues","expenses","gross profit","operating income","net income"],"span_ids":["708100cc-c555-45ac-bf94-62a90215931a"],"confidence":0.9,"id":"AZIWDT-K6JM3RJ1ABF0PJG","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Understanding the Statement of Retained Earnings","purpose":"The statement of retained earnings details the changes in a company's retained earnings over a period of time. It acts as a bridge between the income statement and the balance sheet.","inputs":[{"name":"Net income","type":"Number","required":true,"description":"The company's net income for the period."},{"name":"Dividends paid","type":"Number","required":true,"description":"The amount of dividends paid to shareholders during the period."},{"name":"Beginning retained earnings","type":"Number","required":true,"description":"The company's retained earnings balance at the beginning of the period."}],"preconditions":["Understanding of the income statement and balance sheet"],"steps":[{"n":1,"text":"Understand that the statement of retained earnings details the changes in a company's retained earnings over a period of time."},{"n":2,"text":"Recognize that retained earnings represents the sum of a company's undistributed profits over its entire existence."},{"n":3,"text":"Understand that dividend payments are not an expense, but rather a distribution of profits."},{"n":4,"text":"Recognize that the statement of retained earnings acts as a bridge between the income statement and the balance sheet."},{"n":5,"text":"Calculate the ending retained earnings balance by adding net income and subtracting dividends paid from the beginning balance."}],"outputs":[{"name":"Ending retained earnings","type":"Number","description":"The company's retained earnings balance at the end of the period."}],"failure_modes":["Misunderstanding the relationship between the statement of retained earnings, income statement, and balance sheet","Incorrectly treating dividend payments as an expense"],"examples":[{"input":{"net_income":90000,"dividends_paid":50000,"beginning_retained_earnings":40000},"output":{"ending_retained_earnings":80000},"notes":"The example demonstrates the calculation of ending retained earnings based on net income, dividends paid, and the beginning balance."}],"tags":["statement of retained earnings","retained earnings","dividends","bridge between financial statements"],"span_ids":["b98a74a2-31d2-44e5-88ae-389a5130e8b6"],"confidence":0.9,"id":"AZIWDT-KPHUNWERC-_D_QG","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}