{"name":"Accounting Equation","purpose":"Explain the fundamental accounting equation that must always be true, with no exceptions.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand that the accounting equation is always true, with no exceptions."},{"n":2,"text":"Recognize that owners' equity is just a plug in the equation."},{"n":3,"text":"Realize that your asset is someone else's liability."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["accounting equation","financial statements"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKAC8CWXORMYLNO4AW","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Balance Sheet","purpose":"Explain the purpose and structure of the balance sheet, a financial statement that provides a snapshot of a company's assets, liabilities, and equity at a specific point in time.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand that the balance sheet is a snapshot of a company's assets, liabilities, and equity at a specific point in time."},{"n":2,"text":"Recognize the difference between current and long-term assets and liabilities."},{"n":3,"text":"Compare and contrast two-period balance sheets to see changes over time."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["balance sheet","financial statements"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKAD59L_STIXEL9AEA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Income Statement","purpose":"Explain the purpose and structure of the income statement, a financial statement that shows a company's revenue, expenses, and net income over a period of time.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand that the income statement shows a company's revenue, expenses, and net income over a period of time, as opposed to a snapshot like the balance sheet."},{"n":2,"text":"Recognize the difference between gross profit, cost of goods sold, operating income, and net income."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["income statement","financial statements"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADSVEYENYQ5SHU8W","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Statement of Retained Earnings","purpose":"Explain the purpose and structure of the statement of retained earnings, a financial statement that bridges the gap between the balance sheet and income statement by showing changes in a company's retained earnings over a period of time.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand that the statement of retained earnings is a bridge between the balance sheet and income statement, showing changes in a company's retained earnings over a period of time."},{"n":2,"text":"Recognize that dividends are not an expense, but rather a distribution of retained earnings."},{"n":3,"text":"Realize that retained earnings are not the same as cash, as they represent the cumulative net income that has not been distributed as dividends."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["statement of retained earnings","financial statements"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADDDUV1VB3DYEWYA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Cash Flow Statement","purpose":"Explain the purpose and structure of the cash flow statement, a financial statement that shows a company's cash inflows and outflows from operating, investing, and financing activities over a period of time.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand that the cash flow statement shows a company's cash inflows and outflows from operating, investing, and financing activities over a period of time, as opposed to the income statement which shows revenue and expenses."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["cash flow statement","financial statements"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKAD4FADDERVVGCWDA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Financial Ratios","purpose":"Explain the purpose and types of financial ratios that can be calculated from a company's financial statements to analyze its liquidity, profitability, financial leverage, and asset utilization.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand that financial ratios can be calculated from a company's financial statements to analyze its liquidity, profitability, financial leverage, and asset utilization."},{"n":2,"text":"Recognize the different categories of financial ratios, such as liquidity ratios, profitability ratios, financial leverage ratios, and asset turnover ratios."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["financial ratios","financial analysis"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADBQUVLXM_W2W5JQ","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"GAAP","purpose":"Explain what Generally Accepted Accounting Principles (GAAP) are, who has to follow them, and how they provide a standardized framework for financial reporting.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand that GAAP are the standardized accounting principles and guidelines that companies must follow when preparing financial statements."},{"n":2,"text":"Recognize that companies that issue public financial statements are required to follow GAAP."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["GAAP","accounting principles"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKAD-84VTTUDDH2C8Q","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Debits and Credits","purpose":"Explain the double-entry accounting system of debits and credits, and how they are used to record transactions in the general ledger.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand the double-entry accounting system, where every transaction is recorded with a debit and a credit."},{"n":2,"text":"Recognize how the general ledger and T-accounts are used to track debits and credits."},{"n":3,"text":"Explain how the trial balance is used to ensure the debits and credits balance."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["debits and credits","double-entry accounting"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADGBNDMXVIBW_V-A","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Cash vs. Accrual Accounting","purpose":"Explain the differences between the cash method and accrual method of accounting, including how they treat prepaid expenses and unearned revenue.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand the cash method of accounting, where revenue and expenses are recorded when cash is received or paid."},{"n":2,"text":"Understand the accrual method of accounting, where revenue and expenses are recorded when earned or incurred, regardless of when cash is exchanged."},{"n":3,"text":"Recognize how prepaid expenses and unearned revenue are treated differently under the cash vs. accrual methods."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["cash accounting","accrual accounting"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADTC27ZCUPJYYAEW","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Accounting Close Process","purpose":"Explain the process of closing the books at the end of an accounting period, including the use of closing journal entries.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand the accounting close process, where temporary accounts are closed out at the end of an accounting period through closing journal entries."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["accounting close process","closing journal entries"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADSHG3RBBNG2DX_W","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Accounting Concepts","purpose":"Explain key accounting concepts and principles, such as historical cost, materiality, and the matching principle.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand the key accounting concepts and principles, including historical cost, materiality, money unit assumption, and the matching principle."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["accounting concepts","accounting principles"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADNGMBSVHOPSQRBQ","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Depreciation of Fixed Assets","purpose":"Explain how the cost of fixed assets is allocated over their useful life through the process of depreciation, including different depreciation methods and the concept of accumulated depreciation.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand the concept of depreciation, where the cost of a fixed asset is allocated over its useful life."},{"n":2,"text":"Recognize different depreciation methods, such as straight-line depreciation."},{"n":3,"text":"Explain the concept of accumulated depreciation and how it is used to track the total depreciation taken on an asset."},{"n":4,"text":"Discuss the treatment of gains or losses on the sale of a depreciated asset."},{"n":5,"text":"Understand the concept of expensing immaterial purchases rather than capitalizing them as fixed assets."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["depreciation","fixed assets"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADAV3PALYERL77LW","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Amortization of Intangible Assets","purpose":"Explain how the cost of intangible assets is allocated over their useful life through the process of amortization, including the concept of legal life vs. expected useful life.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand the concept of intangible assets and how their cost is allocated over their useful life through amortization."},{"n":2,"text":"Recognize that the amortization period may be based on the legal life or the expected useful life of the intangible asset."},{"n":3,"text":"Explain that intangible assets are typically amortized on a straight-line basis."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["amortization","intangible assets"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKAD5OE7LHJ8GJBILA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Inventory and Cost of Goods Sold","purpose":"Explain how a company accounts for its inventory and calculates the cost of goods sold, including the use of perpetual and periodic inventory systems as well as different cost flow assumptions like FIFO and LIFO.","inputs":[],"preconditions":[],"steps":[{"n":1,"text":"Understand the concept of cost of goods sold (CoGS) and how it is calculated based on a company's inventory."},{"n":2,"text":"Recognize the difference between perpetual and periodic inventory systems."},{"n":3,"text":"Explain the different cost flow assumptions, such as FIFO and LIFO, and how they impact the calculation of CoGS and inventory valuation."},{"n":4,"text":"Discuss the average cost method as another approach to determining inventory cost and CoGS."}],"outputs":[],"failure_modes":[],"examples":[],"tags":["inventory","cost of goods sold"],"span_ids":["630a8b4b-fff7-4775-963f-dcf89bb8278a"],"confidence":0.9,"id":"AZIWXKADGRBPAQSD5CGLIQ","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Understanding the Accounting Equation","purpose":"Explain the fundamental accounting concept of the accounting equation and how it relates to assets, liabilities, and owners' equity.","inputs":[{"name":"None","type":"None","required":true,"description":"No inputs required."}],"preconditions":["The reader has a basic understanding of financial statements."],"steps":[{"n":1,"text":"Explain that the accounting equation states that at all times, and without exceptions, the following will be true: Assets = Liabilities + Owners' Equity."},{"n":2,"text":"Define assets as all the property owned by the company."},{"n":3,"text":"Define liabilities as all the debts that the company currently has outstanding to lenders."},{"n":4,"text":"Define owners' equity as the company's ownership interest in its assets, after all debts have been repaid."},{"n":5,"text":"Provide a simple example using homeownership to illustrate the accounting equation."},{"n":6,"text":"Explain that owners' equity is simply the leftover amount after paying off the liabilities/debts, and it can be thought of as Assets - Liabilities = Owners' Equity."},{"n":7,"text":"Discuss the concept that a liability for one person is an asset for somebody else, such as a loan or a bank account balance."}],"outputs":[{"name":"Understanding of the accounting equation","type":"Conceptual","description":"The reader should understand the fundamental accounting equation and how it relates to assets, liabilities, and owners' equity."}],"failure_modes":["The reader does not understand the relationship between assets, liabilities, and owners' equity."],"examples":[{"input":"None","output":"The accounting equation: Assets = Liabilities + Owners' Equity","notes":"The reader understands the accounting equation and how it relates to a simple example of homeownership."}],"tags":["accounting","financial statements","accounting equation"],"span_ids":["38153e8b-5080-402a-ae4b-11c16b1357d7"],"confidence":0.9,"id":"AZIWXPO0S4EZM-IUTB4V1G","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Understanding the Balance Sheet","purpose":"Explain the purpose and structure of a company's balance sheet, including the categories of assets, liabilities, and owners' equity.","inputs":[{"name":"None","type":"None","required":true,"description":"No inputs required."}],"preconditions":["The reader has a basic understanding of the accounting equation."],"steps":[{"n":1,"text":"Explain that the balance sheet shows a company's financial situation at a given point in time."},{"n":2,"text":"Describe the three main sections of a balance sheet: assets, liabilities, and owners' equity."},{"n":3,"text":"Define the different types of assets, including cash and cash equivalents, inventory, accounts receivable, and property, plant, and equipment."},{"n":4,"text":"Define the different types of liabilities, including accounts payable and notes payable."},{"n":5,"text":"Define the different components of owners' equity, including common stock and retained earnings."},{"n":6,"text":"Explain the difference between current and long-term assets and liabilities, and how they are presented on the balance sheet."},{"n":7,"text":"Discuss how multiple-period balance sheets can be used to analyze a company's financial position over time."}],"outputs":[{"name":"Understanding of the balance sheet","type":"Conceptual","description":"The reader should understand the purpose and structure of a company's balance sheet, including the categories of assets, liabilities, and owners' equity."}],"failure_modes":["The reader does not understand the different components of a balance sheet or how to interpret it."],"examples":[{"input":"None","output":"A company's balance sheet showing its assets, liabilities, and owners' equity at a given point in time.","notes":"The reader understands the purpose and structure of a balance sheet and how to interpret it."}],"tags":["accounting","financial statements","balance sheet"],"span_ids":["a4d5bcc9-66f0-4d70-82f9-44f8ea27fd46"],"confidence":0.9,"id":"AZIWXPO0C-DL_LX98HISMA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Understanding the Income Statement","purpose":"Explain the purpose and structure of a company's income statement, including the concepts of revenue, cost of goods sold, gross profit, operating expenses, and net income.","inputs":[{"name":"None","type":"None","required":true,"description":"No inputs required."}],"preconditions":["The reader has a basic understanding of the balance sheet."],"steps":[{"n":1,"text":"Explain that the income statement shows a company's financial performance over a period of time, usually one year."},{"n":2,"text":"Describe the two main sections of the income statement: revenue and expenses."},{"n":3,"text":"Define gross profit as the company's revenues minus its cost of goods sold."},{"n":4,"text":"Provide examples to illustrate the concepts of revenue, cost of goods sold, and gross profit."},{"n":5,"text":"Explain the difference between operating income and net income, and how operating expenses are distinguished from non-operating expenses."},{"n":6,"text":"Discuss how the income statement can be used to analyze a company's financial performance and profitability."}],"outputs":[{"name":"Understanding of the income statement","type":"Conceptual","description":"The reader should understand the purpose and structure of a company's income statement, including the concepts of revenue, cost of goods sold, gross profit, operating expenses, and net income."}],"failure_modes":["The reader does not understand the different components of an income statement or how to interpret it."],"examples":[{"input":"None","output":"A company's income statement showing its revenue, cost of goods sold, gross profit, operating expenses, and net income over a period of time.","notes":"The reader understands the purpose and structure of an income statement and how to interpret it."}],"tags":["accounting","financial statements","income statement"],"span_ids":["4ebbd7bf-2eb7-4165-8750-b7c83cae1fa1"],"confidence":0.9,"id":"AZIWXPO0BJPSO729LVZZ9G","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Understanding the Statement of Retained Earnings","purpose":"Explain the purpose and structure of a company's statement of retained earnings, and how it connects the income statement and balance sheet.","inputs":[{"name":"None","type":"None","required":true,"description":"No inputs required."}],"preconditions":["The reader has a basic understanding of the income statement and balance sheet."],"steps":[{"n":1,"text":"Explain that the statement of retained earnings details the changes in a company's retained earnings over a period of time."},{"n":2,"text":"Define retained earnings as the sum of a company's undistributed profits over its entire existence, distinguishing it from profits that have been distributed as dividends."},{"n":3,"text":"Provide examples to illustrate how the statement of retained earnings is prepared, including the impact of net income and dividend payments."},{"n":4,"text":"Explain how the statement of retained earnings acts as a bridge between the income statement and balance sheet, taking information from the income statement and providing information to the balance sheet."},{"n":5,"text":"Discuss the concept that retained earnings is not the same as cash, as profits may have been reinvested in the business rather than held as cash."}],"outputs":[{"name":"Understanding of the statement of retained earnings","type":"Conceptual","description":"The reader should understand the purpose and structure of a company's statement of retained earnings, and how it connects the income statement and balance sheet."}],"failure_modes":["The reader does not understand the purpose of the statement of retained earnings or how it relates to the other financial statements."],"examples":[{"input":"None","output":"A company's statement of retained earnings showing the changes in its retained earnings over a period of time.","notes":"The reader understands the purpose and structure of the statement of retained earnings and how it connects the income statement and balance sheet."}],"tags":["accounting","financial statements","statement of retained earnings"],"span_ids":["ccaa7567-3edc-486f-9bca-6c9fec75d8bf"],"confidence":0.9,"id":"AZIWXPO0DKG6FYQJ9HRX3G","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Record a transaction using double-entry accounting","purpose":"Explain how to record a transaction using the double-entry accounting system, where each transaction results in two entries being made to maintain the accounting equation (Assets = Liabilities + Owners' Equity).","inputs":[{"name":"transaction","type":"any","required":true,"description":"The details of the transaction to be recorded"}],"preconditions":["The transaction involves an increase or decrease in assets, liabilities, or owners' equity"],"steps":[{"n":1,"text":"Identify the accounts affected by the transaction and determine whether they are asset, liability, or equity accounts."},{"n":2,"text":"Record a debit entry to increase an asset account or decrease a liability or equity account."},{"n":3,"text":"Record a credit entry to decrease an asset account or increase a liability or equity account."},{"n":4,"text":"Ensure that the total debits equal the total credits for the transaction."}],"outputs":[{"name":"journal entry","type":"string","description":"The double-entry journal entry recording the transaction"}],"failure_modes":["Debits and credits are recorded incorrectly, causing the accounting equation to be out of balance"],"examples":[{"input":{"transaction":"A company uses $40,000 cash to purchase a new piece of equipment"},"output":"DR. Equipment 40,000\nCR. Cash 40,000"},{"input":{"transaction":"Chris' Construction takes out a $50,000 loan with a local bank"},"output":"DR. Cash 50,000\nCR. Notes Payable 50,000"},{"input":{"transaction":"Darla's Dresses writes a check for their monthly rent of $4,500"},"output":"DR. Rent Expense 4,500\nCR. Cash 4,500"}],"tags":["double-entry accounting","debits and credits","journal entries"],"span_ids":["bf3bac5d-4f03-4fb6-b774-99d6e46bd35a","1481e674-69ca-4c19-8ddb-a972a4251171"],"confidence":0.9,"id":"AZIWXBMDRONHK1KIQPKGLW","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Prepare financial statements using the accrual method","purpose":"Explain how to use the accrual method of accounting to prepare financial statements that accurately reflect the economic reality of a business's operations, regardless of when cash is exchanged.","inputs":[{"name":"accounting transactions","type":"any","required":true,"description":"The transactions that occurred during the accounting period"}],"preconditions":["The business is required to follow GAAP and use the accrual method of accounting"],"steps":[{"n":1,"text":"Record revenue when services are provided or goods are delivered, regardless of when cash is received."},{"n":2,"text":"Record expenses when goods or services are received, regardless of when they are paid for."},{"n":3,"text":"Use accounts like Accounts Receivable and Accounts Payable to track amounts owed to or by the business."},{"n":4,"text":"Adjust for prepaid expenses and unearned revenue to match the timing of recognition with the economic reality."},{"n":5,"text":"Prepare the financial statements (income statement, balance sheet, and statement of cash flows) using the accrual-based accounts."}],"outputs":[{"name":"financial statements","type":"any","description":"The company's financial statements prepared using the accrual method"}],"failure_modes":["Revenues and expenses are not recorded in the correct accounting period, leading to distortions in the financial statements"],"examples":[{"input":{"transactions":[{"type":"revenue","amount":600,"when":"February"},{"type":"expense","amount":93000,"when":"August"},{"type":"loan","amount":15000,"when":"January 1"},{"type":"rent","amount":4500,"when":"April 1"}]},"output":{"income_statement":{"revenue":600,"expenses":[{"name":"commissions","amount":93000},{"name":"rent","amount":4500}],"net_income":-97900},"balance_sheet":{"assets":{"cash":15000,"accounts_receivable":600,"prepaid_rent":4500},"liabilities":{"accounts_payable":93000,"notes_payable":15000},"equity":-88900}}}],"tags":["accrual accounting","revenue recognition","expense recognition","financial statements"],"span_ids":["6a0847e3-b32b-4dd2-a535-3a54c4b4b64f"],"confidence":0.85,"id":"AZIWXBMDM8AELGWZV_WARA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Perform the accounting close process","purpose":"Explain the steps involved in the accounting close process at the end of each accounting period to prepare the financial statements.","inputs":[{"name":"general ledger accounts","type":"any","required":true,"description":"The balances in the company's general ledger accounts at the end of the accounting period"}],"preconditions":["The company is following GAAP and using the accrual method of accounting"],"steps":[{"n":1,"text":"Zero out the balances in all temporary accounts (revenue, expense, gain, and loss accounts)."},{"n":2,"text":"Transfer the balances from the temporary accounts to an Income Summary account."},{"n":3,"text":"Record a journal entry to close the Income Summary account balance to Retained Earnings."},{"n":4,"text":"Prepare the financial statements (income statement, balance sheet, and statement of cash flows) using the updated account balances."}],"outputs":[{"name":"financial statements","type":"any","description":"The company's financial statements prepared after the accounting close process"}],"failure_modes":["Errors in the closing journal entries lead to inaccurate financial statements"],"examples":[{"input":{"trial_balance":{"cash":70000,"accounts_receivable":30000,"investments":50000,"accounts_payable":10000,"common_stock":40000,"retained_earnings":45000,"sales":200000,"gain_on_sale_of_investments":10000,"rent_expense":30000,"wages_and_salary_expense":110000,"advertising_expense":15000}},"output":{"closing_entries":[{"debit":"Sales","credit":"Income Summary","amount":200000},{"debit":"Gain on Sale of Investments","credit":"Income Summary","amount":10000},{"debit":"Income Summary","credit":"Rent Expense","amount":30000},{"debit":"Income Summary","credit":"Wages and Salary Expense","amount":110000},{"debit":"Income Summary","credit":"Advertising Expense","amount":15000},{"debit":"Income Summary","credit":"Retained Earnings","amount":55000}],"financial_statements":{"income_statement":{"revenue":200000,"expenses":[{"name":"Rent Expense","amount":30000},{"name":"Wages and Salary Expense","amount":110000},{"name":"Advertising Expense","amount":15000}],"other_income":10000,"net_income":55000},"balance_sheet":{"assets":{"cash":70000,"accounts_receivable":30000,"investments":50000},"liabilities":{"accounts_payable":10000},"equity":{"common_stock":40000,"retained_earnings":100000}}}}}],"tags":["accounting close process","closing journal entries","financial statements"],"span_ids":["d198ba5b-3488-44d2-916f-dd004c12cd27"],"confidence":0.9,"id":"AZIWXBMDQPEVD_UKIXJRWG","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Calculating Cost of Goods Sold Under the Periodic Method of Inventory","purpose":"Explain how to calculate Cost of Goods Sold (CoGS) using the periodic method of inventory management, where inventory is counted at regular intervals rather than tracked continuously.","inputs":[{"name":"Beginning Inventory","type":"monetary amount","required":true,"description":"The value of inventory on hand at the start of the accounting period."},{"name":"Purchases","type":"monetary amount","required":true,"description":"The total cost of inventory purchased during the accounting period."},{"name":"Ending Inventory","type":"monetary amount","required":true,"description":"The value of inventory on hand at the end of the accounting period."}],"preconditions":["The business is using the periodic method of inventory, where inventory is counted at regular intervals rather than tracked continuously."],"steps":[{"n":1,"text":"Calculate the total Cost of Goods Available for Sale by adding the Beginning Inventory and the Purchases."},{"n":2,"text":"Subtract the Ending Inventory from the Cost of Goods Available for Sale to determine the Cost of Goods Sold for the period."}],"outputs":[{"name":"Cost of Goods Sold","type":"monetary amount","description":"The total cost of the inventory that was sold during the accounting period."}],"failure_modes":["Inventory theft is not tracked, so stolen items will be included in the Cost of Goods Sold calculation.","The calculation does not track the specific costs of individual inventory items sold, so assumptions must be made about which items were sold (e.g. FIFO, LIFO, Average Cost)."],"examples":[{"input":{"Beginning Inventory":800,"Purchases":2400,"Ending Inventory":600},"output":2600,"notes":"Cost of Goods Sold = Beginning Inventory ($800) + Purchases ($2400) - Ending Inventory ($600) = $2600"}],"tags":["inventory","cost of goods sold","periodic method"],"span_ids":["15532ce1-2740-480a-832d-6f644a493644"],"confidence":1,"id":"AZIWXLMQIRCLXFNKBZ33HA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Calculating Cost of Goods Sold Using FIFO (First-In, First-Out) Method","purpose":"Explain how to calculate Cost of Goods Sold (CoGS) using the FIFO (First-In, First-Out) inventory valuation method, where the oldest inventory items are assumed to be sold first.","inputs":[{"name":"Beginning Inventory Units and Cost","type":"list of {units, cost per unit}","required":true,"description":"The quantity and cost per unit of inventory on hand at the start of the accounting period."},{"name":"Purchases Units and Cost","type":"list of {units, cost per unit}","required":true,"description":"The quantity and cost per unit of inventory purchased during the accounting period."},{"name":"Units Sold","type":"number","required":true,"description":"The total number of inventory units sold during the accounting period."}],"preconditions":["The business is using the FIFO (First-In, First-Out) method to value inventory and calculate Cost of Goods Sold.","The business has information about the quantity and cost per unit of both the beginning inventory and purchases during the period."],"steps":[{"n":1,"text":"Assume the oldest (earliest) inventory units are sold first under the FIFO method."},{"n":2,"text":"Calculate the Cost of Goods Sold by summing the cost of the oldest inventory units sold, up to the total number of units sold."},{"n":3,"text":"Calculate the Ending Inventory value by subtracting the units sold from the total available units, and multiplying the remaining units by their respective costs."}],"outputs":[{"name":"Cost of Goods Sold","type":"monetary amount","description":"The total cost of the inventory that was sold during the accounting period."},{"name":"Ending Inventory","type":"monetary amount","description":"The total value of inventory remaining at the end of the accounting period."}],"failure_modes":["The FIFO method may not accurately reflect the current market value of inventory if costs have changed significantly."],"examples":[{"input":{"Beginning Inventory":[{"units":50,"cost per unit":3}],"Purchases":[{"units":60,"cost per unit":3},{"units":40,"cost per unit":3.5}],"Units Sold":100},"output":{"Cost of Goods Sold":300,"Ending Inventory":170},"notes":"Under FIFO, the 100 units sold are assumed to be the 50 units from beginning inventory ($3 each) and 50 units from the first purchase ($3 each), resulting in a CoGS of $300. The remaining 50 units are from the second purchase at $3.50 each, for an ending inventory value of $170."}],"tags":["inventory","cost of goods sold","FIFO"],"span_ids":["15532ce1-2740-480a-832d-6f644a493644"],"confidence":1,"id":"AZIWXLMQASF6ZAZQ8OY89Q","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Calculating Cost of Goods Sold Using LIFO (Last-In, First-Out) Method","purpose":"Explain how to calculate Cost of Goods Sold (CoGS) using the LIFO (Last-In, First-Out) inventory valuation method, where the most recently purchased inventory items are assumed to be sold first.","inputs":[{"name":"Beginning Inventory Units and Cost","type":"list of {units, cost per unit}","required":true,"description":"The quantity and cost per unit of inventory on hand at the start of the accounting period."},{"name":"Purchases Units and Cost","type":"list of {units, cost per unit}","required":true,"description":"The quantity and cost per unit of inventory purchased during the accounting period."},{"name":"Units Sold","type":"number","required":true,"description":"The total number of inventory units sold during the accounting period."}],"preconditions":["The business is using the LIFO (Last-In, First-Out) method to value inventory and calculate Cost of Goods Sold.","The business has information about the quantity and cost per unit of both the beginning inventory and purchases during the period."],"steps":[{"n":1,"text":"Assume the most recently purchased (newest) inventory units are sold first under the LIFO method."},{"n":2,"text":"Calculate the Cost of Goods Sold by summing the cost of the newest inventory units sold, up to the total number of units sold."},{"n":3,"text":"Calculate the Ending Inventory value by subtracting the units sold from the total available units, and multiplying the remaining units by their respective costs."}],"outputs":[{"name":"Cost of Goods Sold","type":"monetary amount","description":"The total cost of the inventory that was sold during the accounting period."},{"name":"Ending Inventory","type":"monetary amount","description":"The total value of inventory remaining at the end of the accounting period."}],"failure_modes":["The LIFO method may not accurately reflect the current market value of inventory if costs have changed significantly."],"examples":[{"input":{"Beginning Inventory":[{"units":50,"cost per unit":3}],"Purchases":[{"units":60,"cost per unit":3},{"units":40,"cost per unit":3.5}],"Units Sold":100},"output":{"Cost of Goods Sold":320,"Ending Inventory":150},"notes":"Under LIFO, the 100 units sold are assumed to be the 40 units from the most recent purchase ($3.50 each) and 60 units from the earlier purchase ($3 each), resulting in a CoGS of $320. The remaining 50 units are from the beginning inventory at $3 each, for an ending inventory value of $150."}],"tags":["inventory","cost of goods sold","LIFO"],"span_ids":["15532ce1-2740-480a-832d-6f644a493644"],"confidence":1,"id":"AZIWXLMQ2KVJYJVVCSOKEQ","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}
{"name":"Calculating Cost of Goods Sold Using Average Cost Method","purpose":"Explain how to calculate Cost of Goods Sold (CoGS) and Ending Inventory using the Average Cost inventory valuation method, where a weighted average cost per unit is used.","inputs":[{"name":"Beginning Inventory Units and Cost","type":"list of {units, cost per unit}","required":true,"description":"The quantity and cost per unit of inventory on hand at the start of the accounting period."},{"name":"Purchases Units and Cost","type":"list of {units, cost per unit}","required":true,"description":"The quantity and cost per unit of inventory purchased during the accounting period."},{"name":"Units Sold","type":"number","required":true,"description":"The total number of inventory units sold during the accounting period."}],"preconditions":["The business is using the Average Cost method to value inventory and calculate Cost of Goods Sold.","The business has information about the quantity and cost per unit of both the beginning inventory and purchases during the period."],"steps":[{"n":1,"text":"Calculate the weighted average cost per unit based on the total Cost of Goods Available for Sale divided by the total Units Available for Sale."},{"n":2,"text":"Multiply the average cost per unit by the Units Sold to determine the Cost of Goods Sold for the period."},{"n":3,"text":"Multiply the average cost per unit by the remaining Ending Inventory units to determine the Ending Inventory value."}],"outputs":[{"name":"Cost of Goods Sold","type":"monetary amount","description":"The total cost of the inventory that was sold during the accounting period."},{"name":"Ending Inventory","type":"monetary amount","description":"The total value of inventory remaining at the end of the accounting period."}],"failure_modes":["The Average Cost method may not accurately reflect the current market value of inventory if costs have changed significantly during the period."],"examples":[{"input":{"Beginning Inventory":[{"units":50,"cost per unit":3}],"Purchases":[{"units":60,"cost per unit":3},{"units":40,"cost per unit":3.5}],"Units Sold":100},"output":{"Cost of Goods Sold":313,"Ending Inventory":157},"notes":"The total Cost of Goods Available for Sale is $470 (110 units at $3 each and 40 units at $3.50 each). The total Units Available for Sale is 150, so the average cost per unit is $3.13. Multiplying the 100 units sold by $3.13 results in a CoGS of $313. The remaining 50 units at $3.13 each equals an Ending Inventory value of $157."}],"tags":["inventory","cost of goods sold","average cost"],"span_ids":["15532ce1-2740-480a-832d-6f644a493644"],"confidence":1,"id":"AZIWXLMQPLHJMOTCQS-CBA","documentId":"23f73479-fb69-4719-b650-5f4c0c25968d"}